Revit 2024 API
ICustomFieldProperties Interface
 Represents the base class for the properties of a custom field.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public interface ICustomFieldProperties
Visual Basic
Public Interface ICustomFieldProperties
Visual C++
public interface class ICustomFieldProperties
See Also
ICustomFieldProperties Members
Autodesk.Revit.DB Namespace